src_Extension/Documents/ПоступлениеБезналичныхДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПоступлениеБезналичныхДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БанковскийСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БанковскийСчетОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_Extension/Documents/ПоступлениеБезналичныхДенежныхСредств/Ext/ObjectModule.bsl
Процедура Расш_ЗаполнитьПоЗаказуКлиента( ЗаказКлиента )
	
	НаименованиеГрузоотправителя = ЗаказКлиента.Грузоотправитель.Наименование;
	Если СтрНайти(НаименованиеГрузоотправителя, "ЭТП-ТРЕЙДИНГ") <> 0
	Тогда
		//ЗАОПОЭТП = Справочники.Организации.НайтиПоРеквизиту("ИНН", "5506052891");
		БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.НайтиПоНаименованию("ЭТП-ТРЕЙДИНГ (основной)",,, );
	КонецЕсли;
	РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента;
	Комментарий = "# " + НаименованиеГрузоотправителя + ", счет " + ЗаказКлиента.БанковскийСчетГрузоотправителя;
	
КонецПроцедуры

//не работает!
&После("ОбработкаЗаполнения")
Процедура Расш1_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента")
	Тогда
	
		НаименованиеГрузоотправителя = ДанныеЗаполнения.Грузоотправитель.Наименование;
		Если СтрНайти(НаименованиеГрузоотправителя, "ЭТП-ТРЕЙДИНГ") <> 0
	        Тогда
			ЗАОПОЭТП = Справочники.Организации.НайтиПоРеквизиту("ИНН", "5506052891");
			БанковскийСчетКонтрагента = Справочники.БанковскиеСчетаОрганизаций.НайтиПоНаименованию("ЭТП-ТРЕЙДИНГ",,,ЗАОПОЭТП );
		КонецЕсли;
		РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента;
		Комментарий = "# " + НаименованиеГрузоотправителя + ", счет " + ДанныеЗаполнения.БанковскийСчетГрузоотправителя;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И
			ДанныеЗаполнения.Свойство("Основание")
	Тогда
	
		Если ТипЗнч( ДанныеЗаполнения.Основание ) = Тип("Массив")
	        Тогда
		
			ЗаказКлиента = ДанныеЗаполнения.Основание[0].ЗаказКлиента;
			Расш_ЗаполнитьПоЗаказуКлиента( ЗаказКлиента );
			
		КонецЕсли;
		
	ИначеЕсли РасшифровкаПлатежа.Количество() > 0
	Тогда
	
		ЗаказКлиента = РасшифровкаПлатежа[0].ОбъектРасчетов;
//		ЗаказКлиента = РасшифровкаПлатежа[0].ОснованиеПлатежа;
		Если ТипЗнч(ЗаказКлиента) = Тип("ДокументСсылка.ЗаказКлиента")
		Тогда
			Расш_ЗаполнитьПоЗаказуКлиента( ЗаказКлиента );
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
